apojomovsky/pic8-hal/pic18fxx5x-hal/include/peripherals/pic18fxx5x_timer1.h
/**
 * @file    peripherals/pic18fxx5x_timer1.h
 * @brief   Timer1 driver, 16-bit timer/counter.
 *
 * @details
 *   Source: DS39632E §12.0 (Timer1 Module), Register 12-1 (T1CON).
 *
 *   The API matches pic16f87xa_timer1.h (same `TIMER1_HandleTypeDef`,
 *   `HAL_TIMER1_*` names/signatures, weak `TIMER1_IRQHandler`) so consumer
 *   code is portable; the body differs because PIC18's T1CON adds two bits in
 *   the top byte that PIC16 left unimplemented:
 *     - RD16 (T1CON<7>): 16-bit read/write mode. Set by this driver so the
 *       16-bit atomic read/write idiom works as on PIC16 (reading TMR1L
 *       latches TMR1H into a shadow). PIC16 is always 16-bit; PIC18 makes it
 *       a mode bit.
 *     - T1RUN (T1CON<6>): Timer1 system-clock status, read-only; ignored.
 *   The prescaler (1:1/1:2/1:4/1:8), T1OSCEN, T1SYNC, TMR1CS, TMR1ON bits
 *   are at the same positions as PIC16.
 *
 *   Wiring: 16-bit counter TMR1H:TMR1L; clock Fosc/4 (TMR1CS=0) or external
 *   T1CKI/T1OSC (TMR1CS=1); T1OSCEN enables the 32.768 kHz crystal on
 *   T1OSI/T1OSO; overflow (0xFFFF -> 0x0000) sets PIR1<TMR1IF>.
 *
 *   Reset (DS39632E Table 5-1): T1CON = 0x00 (off, 1:1, internal, T1OSC off,
 *   sync, RD16 off). TMR1H/L unknown at POR. The driver sets RD16 on init.
 */

#ifndef PIC18FXX5X_TIMER1_H
#define PIC18FXX5X_TIMER1_H

#include "pic18fxx5x.h"
#include "pic18fxx5x_sfr.h"

/**
 * @brief Timer1 clock source (T1CON<TMR1CS>, DS39632E Register 12-1).
 */
typedef enum {
    TIMER1_CLOCK_INTERNAL  = 0x0U,   /**< Fosc/4 (timer mode). */
    TIMER1_CLOCK_EXTERNAL  = 0x1U,   /**< External pin or T1OSC. */
} TIMER1_ClockSourceTypeDef;

/**
 * @brief External-clock synchronisation (T1CON<T1SYNC>, DS39632E §12.0).
 *        In timer mode (internal clock) this bit is ignored.
 */
typedef enum {
    TIMER1_SYNC_EXTERNAL   = 0x0U,   /**< T1SYNC = 0, synchronise to Fosc. */
    TIMER1_ASYNC_EXTERNAL  = 0x1U,   /**< T1SYNC = 1, free-running. */
} TIMER1_ClockSyncTypeDef;

/**
 * @brief T1OSC crystal-oscillator enable (T1CON<T1OSCEN>, DS39632E §12.0).
 *        Requires a 32.768 kHz crystal on T1OSI/T1OSO; the standard RTC
 *        time base.
 */
typedef enum {
    TIMER1_OSCILLATOR_OFF  = 0x0U,
    TIMER1_OSCILLATOR_ON   = 0x1U,
} TIMER1_OscillatorTypeDef;

/**
 * @brief Prescaler ratio (T1CON<T1CKPS1:T1CKPS0>, DS39632E Register 12-1).
 */
typedef enum {
    TIMER1_PRESCALER_1_1 = 0x0U,    /**< 1:1, 00. */
    TIMER1_PRESCALER_1_2 = 0x1U,    /**< 1:2, 01. */
    TIMER1_PRESCALER_1_4 = 0x2U,    /**< 1:4, 10. */
    TIMER1_PRESCALER_1_8 = 0x3U,    /**< 1:8, 11. */
} TIMER1_PrescalerTypeDef;

/** Driver handle (Cube-style). */
typedef struct {
    TIMER1_ClockSourceTypeDef  ClockSource;
    TIMER1_ClockSyncTypeDef    ClockSync;
    TIMER1_OscillatorTypeDef   Oscillator;
    TIMER1_PrescalerTypeDef    Prescaler;
    uint16_t                   ReloadValue;   /**< 16-bit initial counter. */
    /** @brief Optional overflow callback (fires on TMR1IF). */
    void (*OverflowCallback)(void);
} TIMER1_HandleTypeDef;

#define TIMER1_HANDLE_DEFAULT {                                         \
    .ClockSource      = TIMER1_CLOCK_INTERNAL,                          \
    .ClockSync        = TIMER1_SYNC_EXTERNAL,                           \
    .Oscillator       = TIMER1_OSCILLATOR_OFF,                          \
    .Prescaler        = TIMER1_PRESCALER_1_1,                            \
    .ReloadValue      = 0x0000U,                                        \
    .OverflowCallback = NULL,                                           \
}

HAL_StatusTypeDef HAL_TIMER1_Init(const TIMER1_HandleTypeDef *h);
HAL_StatusTypeDef HAL_TIMER1_DeInit(void);
HAL_StatusTypeDef HAL_TIMER1_Start(const TIMER1_HandleTypeDef *h);
HAL_StatusTypeDef HAL_TIMER1_Stop(void);

/** Atomically read the 16-bit counter (RD16 latches TMR1H on TMR1L read). */
uint16_t HAL_TIMER1_ReadCounter(void);

/** Atomically write the 16-bit counter (RD16 latches TMR1H on TMR1L write). */
void HAL_TIMER1_WriteCounter(uint16_t value);

/** Convert a prescaler enum to its integer ratio (1, 2, 4, 8). */
uint16_t HAL_TIMER1_PrescalerToRatio(TIMER1_PrescalerTypeDef p);

/** Weak Timer1 ISR, override in user code to add application logic. */
void TIMER1_IRQHandler(void) PIC8_WEAK;

#endif /* PIC18FXX5X_TIMER1_H */